IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART5_UART5.xml
	<register id="UART5_XON1_ADDR1" acronym="UART5_XON1_ADDR1" offset="0x10" width="8" description="">
		<bitfield id="XON_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON1 character in UART modes and ADDR1 address 1 for IrDA modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_MCR" acronym="UART5_MCR" offset="0x10" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Not Defined" range="7" rwaccess="RO"/> 
		<bitfield id="TCR_TLR" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   TCR_TLR_VALUE_0No action      1   |   TCR_TLR_VALUE_1Enables access to the TCR and TLR registers.  " range="6" rwaccess="RW"/> 
		<bitfield id="XON_EN" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   XON_EN_VALUE_0Disable 'XON any' function      1   |   XON_EN_VALUE_1Enable 'XON any' function  " range="5" rwaccess="RW"/> 
		<bitfield id="LOOPBACK_EN" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   LOOPBACK_EN_VALUE_0Normal operating mode      1   |   LOOPBACK_EN_VALUE_1Enable local loopback mode (internal). In this mode the MCR[3:0] signals are looped back into MSR[7:4]. The transmit output is looped back to the receive input internally  " range="4" rwaccess="RW"/> 
		<bitfield id="CD_STS_CH" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   CD_STS_CH_VALUE_0In loopback forces DCD* input high and IRQ outputs to inactive state.      1   |   CD_STS_CH_VALUE_1In loopback forces DCD* input low and IRQ outputs to inactive state.  " range="3" rwaccess="RW"/> 
		<bitfield id="RI_STS_CH" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   RI_STS_CH_VALUE_0In loopback forces RI* input high.      1   |   RI_STS_CH_VALUE_1In loopback forces RI* input low.  " range="2" rwaccess="RW"/> 
		<bitfield id="RTS" width="1" begin="1" end="1" resetval="0x0" description="In loop back controls MSR[4].If auto-RTS is enabled the RTS* output is controlled by hardware flow control.    0   |   RTS_VALUE_0Force RTS* output to inactive (high).      1   |   RTS_VALUE_1Force RTS* output to active (low).  " range="1" rwaccess="RW"/> 
		<bitfield id="DTR" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   DTR_VALUE_0Force DTR* output to inactive (high).      1   |   DTR_VALUE_1Force DTR* output to active (low).  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART5_XON2_ADDR2" acronym="UART5_XON2_ADDR2" offset="0x14" width="8" description="">
		<bitfield id="XON_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON2 character in UART modes and ADDR2 address 2 for IrDA modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_LSR_CIR" acronym="UART5_LSR_CIR" offset="0x14" width="8" description="">
		<bitfield id="THR_EMPTY" width="1" begin="7" end="7" resetval="0x1" description="Not Defined    Read0   |   THR_EMPTY_VALUE_0Transmit holding register (TX FIFO) is not empty      Read1   |   THR_EMPTY_VALUE_1Transmit hold register (TX FIFO) is empty. The transmission is not necessarily completed  " range="7" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="6" end="6" resetval="0x0" description="Not Defined" range="6" rwaccess="RO"/> 
		<bitfield id="RX_STOP" width="1" begin="5" end="5" resetval="0x0" description="The RX_STOP is generated based on the value set in the BOF Length register (EBLR). It is cleared on a single read of the LSR register    Read0   |   RX_STOP_VALUE_0Reception is on going or waiting for a new frame      Read1   |   RX_STOP_VALUE_1Reception is completed  " range="5" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    Read0   |   RX_FIFO_E_VALUE_0No data in the receive FIFO      Read1   |   RX_FIFO_E_VALUE_1At least one data character in the RX FIFO  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART5_LSR_IRDA" acronym="UART5_LSR_IRDA" offset="0x14" width="8" description="">
		<bitfield id="THR_EMPTY" width="1" begin="7" end="7" resetval="0x1" description="Not Defined    Read0   |   THR_EMPTY_VALUE_0Transmit holding register (TX FIFO) is not empty      Read1   |   THR_EMPTY_VALUE_1Transmit hold register (TX FIFO) is empty. The transmission is not necessarily completed  " range="7" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_FULL" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    Read0   |   STS_FIFO_FULL_VALUE_0Status FIFO not full      Read1   |   STS_FIFO_FULL_VALUE_1Status FIFO full  " range="6" rwaccess="RO"/> 
		<bitfield id="RX_LAST_BYTE" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    Read0   |   RX_LAST_BYTE_VALUE_0The RX FIFO (RHR) does not contain the last byte of the frame to be read      Read1   |   RX_LAST_BYTE_VALUE_1The RX FIFO (RHR) contains the last byte of the frame to be read.This bit is only set when the last byte of a frame is available to be read. It is used to determine the frame boundary. It is cleared on a single read of the LSR register  " range="5" rwaccess="RO"/> 
		<bitfield id="FRAME_TOO_LONG" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    Read0   |   FRAME_TOO_LONG_VALUE_0No frame-too-long error in frame      Read1   |   FRAME_TOO_LONG_VALUE_1Frame-too-long error in the frame at the top of the STATUS FIFO, [next character to be read]. This bit is set to 1 when a frame exceeding the maximum length (set by RXFLH and RXFLL registers) has been received. When this error is detected, current frame reception is terminated. Reception is stopped until the next START flag is detected  " range="4" rwaccess="RO"/> 
		<bitfield id="ABORT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read0   |   ABORT_VALUE_0No abort pattern error in frame      Read1   |   ABORT_VALUE_1Abort pattern is received. SIR , MIR: Abort pattern. FIR: Illegal symbol  " range="3" rwaccess="RO"/> 
		<bitfield id="CRC" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read0   |   CRC_VALUE_0No CRC error in frame      Read1   |   CRC_VALUE_1CRC error in the frame at the top of the STATUS FIFO (next character to be read)  " range="2" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_E" width="1" begin="1" end="1" resetval="0x1" description="Not Defined    Read0   |   STS_FIFO_E_VALUE_0Status FIFO not empty      Read1   |   STS_FIFO_E_VALUE_1Status FIFO empty  " range="1" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    Read0   |   RX_FIFO_E_VALUE_0No data in the receive FIFO      Read1   |   RX_FIFO_E_VALUE_1At least one data character in the RX FIFO  " range="0" rwaccess="RO"/>
	</register>
