IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART5_UART5.xml
	<register id="UART5_LSR_UART" acronym="UART5_LSR_UART" offset="0x14" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_STS" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    Read0   |   RX_FIFO_STS_VALUE_0Normal operation      Read1   |   RX_FIFO_STS_VALUE_1At least one parity error, framing error or break indication in the RX FIFO. Bit 7 is cleared when no more errors are present in the RX FIFO.  " range="7" rwaccess="RO"/> 
		<bitfield id="TX_SR_E" width="1" begin="6" end="6" resetval="0x1" description="Not Defined    Read0   |   TX_SR_E_VALUE_0Transmitter hold (TX FIFO) and shift registers are not empty.      Read1   |   TX_SR_E_VALUE_1Transmitter hold (TX FIFO) and shift registers are empty  " range="6" rwaccess="RO"/> 
		<bitfield id="TX_FIFO_E" width="1" begin="5" end="5" resetval="0x1" description="Not Defined    Read0   |   TX_FIFO_E_VALUE_0Transmit hold register (TX FIFO) is not empty      Read1   |   TX_FIFO_E_VALUE_1Transmit hold register (TX FIFO) is empty. The transmission is not necessarily completed.  " range="5" rwaccess="RO"/> 
		<bitfield id="RX_BI" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    Read0   |   RX_BI_VALUE_0No break condition      Read1   |   RX_BI_VALUE_1A break was detected while the data being read from the RX FIFO was being received. (i.e. RX input was low for one character + 1 bit time frame).  " range="4" rwaccess="RO"/> 
		<bitfield id="RX_FE" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read0   |   RX_FE_VALUE_0No framing error in data being read from RX FIFO.      Read1   |   RX_FE_VALUE_1Framing error occurred in data being read from RX FIFO.(received data did not have a valid stop bit)  " range="3" rwaccess="RO"/> 
		<bitfield id="RX_PE" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read0   |   RX_PE_VALUE_0No parity error in data being read from RX FIFO.      Read1   |   RX_PE_VALUE_1Parity error in data being read from RX FIFO  " range="2" rwaccess="RO"/> 
		<bitfield id="RX_OE" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   RX_OE_VALUE_0No overrun error      Read1   |   RX_OE_VALUE_1Overrun error has occurred. Set when the character held in the receive shift register is not transferred to the RX FIFO. This case can occurs only when receive FIFO is full.  " range="1" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   RX_FIFO_E_VALUE_0No data in the receive FIFO      Read1   |   RX_FIFO_E_VALUE_1At least one data character in the RX FIFO  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART5_TCR" acronym="UART5_TCR" offset="0x18" width="8" description="">
		<bitfield id="RX_FIFO_TRIG_START" width="4" begin="7" end="4" resetval="0x0" description="RX FIFO trigger level to RESTORE transmission (0 - 60)" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="RX_FIFO_TRIG_HALT" width="4" begin="3" end="0" resetval="0x15" description="RX FIFO trigger level to HALT transmission (0 - 60)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_XOFF1" acronym="UART5_XOFF1" offset="0x18" width="8" description="">
		<bitfield id="XOFF_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF1 character in used in UART modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_MSR" acronym="UART5_MSR" offset="0x18" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="NCD_STS" width="1" begin="7" end="7" resetval="0x0" description="This bit is the complement of the DCD* input. In loop-back mode it is equivalent to MCR[3]" range="7" rwaccess="RO"/> 
		<bitfield id="NRI_STS" width="1" begin="6" end="6" resetval="0x0" description="This bit is the complement of the RI* input. In loop-back mode it is equivalent to MCR[2]" range="6" rwaccess="RO"/> 
		<bitfield id="NDSR_STS" width="1" begin="5" end="5" resetval="0x0" description="This bit is the complement of the DSR* input. In loop-back mode, it is equivalent to MCR[0]" range="5" rwaccess="RO"/> 
		<bitfield id="NCTS_STS" width="1" begin="4" end="4" resetval="0x0" description="This bit is the complement of the CTS* input. In loop-back mode it is equivalent to MCR[1]" range="4" rwaccess="RO"/> 
		<bitfield id="DCD_STS" width="1" begin="3" end="3" resetval="0x0" description="Indicates that DCD* input [or MCR[3] in loop back] has changed. Cleared on a read." range="3" rwaccess="RO"/> 
		<bitfield id="RI_STS" width="1" begin="2" end="2" resetval="0x0" description="Indicates that RI* input [or MCR[2] in loop back] has changed state from low to high. Cleared on a read." range="2" rwaccess="RO"/> 
		<bitfield id="DSR_STS" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read1   |   DSR_STS_VALUE_1Indicates that DSR* input (or MCR[0] in loop back) has changed state. Cleared on a read  " range="1" rwaccess="RO"/> 
		<bitfield id="CTS_STS" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read1   |   CTS_STS_VALUE_1Indicates that CTS* input (or MCR[1] in loop back) has changed state. Cleared on a read.  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART5_TLR" acronym="UART5_TLR" offset="0x1C" width="8" description="">
		<bitfield id="RX_FIFO_TRIG_DMA" width="4" begin="7" end="4" resetval="0x0" description="Receive FIFO trigger level" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="TX_FIFO_TRIG_DMA" width="4" begin="3" end="0" resetval="0x0" description="Transmit FIFO trigger level" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_XOFF2" acronym="UART5_XOFF2" offset="0x1C" width="8" description="">
		<bitfield id="XOFF_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF2 character in used in UART modes." range="7 - 0" rwaccess="RW"/>
	</register>
