IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART5_UART5.xml
	<register id="UART5_FREQ_SEL" acronym="UART5_FREQ_SEL" offset="0x74" width="32" description="">
		<bitfield id="FREQ_SEL" width="8" begin="7" end="0" resetval="0x26" description="Sets the sample per bit if non default frequency is used. MDR3[1] must be set to 1 after this value is set. Must be equal or higher then 6." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_ABAUD_1ST_CHAR" acronym="UART5_ABAUD_1ST_CHAR" offset="0x78" width="32" description="">
		<bitfield id="RESERVED" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="UART5_BAUD_2ND_CHAR" acronym="UART5_BAUD_2ND_CHAR" offset="0x7C" width="32" description="">
		<bitfield id="RESERVED" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="UART5_MDR3" acronym="UART5_MDR3" offset="0x80" width="32" description="">
		<bitfield id="RESERVED2" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DIR_EN" width="1" begin="4" end="4" resetval="0x0" description="RS-485 External Transceiver Direction Enable" range="4" rwaccess="RW"/> 
		<bitfield id="DIR_POL" width="1" begin="3" end="3" resetval="0x0" description="RS-485 External Transceiver Direction Polarity. 0 => TX: RTS=0, RX: RTS=1. 1 => TX: RTS=1, RX: RTS=0" range="3" rwaccess="RW"/> 
		<bitfield id="SET_DMA_TX_THRESHOLD" width="1" begin="2" end="2" resetval="0x0" description="Enable to set different TX DMA threshold then 64-trigger [usage of new register TX_DNA_THRESHOLD]" range="2" rwaccess="RW"/> 
		<bitfield id="NONDEFAULT_FREQ" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/Disables[0] using NONDEFAULT  fclk frequencies" range="1" rwaccess="RW"/> 
		<bitfield id="DISABLE_CIR_RX_DEMOD" width="1" begin="0" end="0" resetval="0x0" description="Disables[1]/Enables[0] CIR RX demodulation    0   |   DISABLE_CIR_RX_DEMOD_VALUE_0Enables CIR RX demodulation      1   |   DISABLE_CIR_RX_DEMOD_VALUE_1Disables CIR RX demodulation  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART5_TX_DMA_THRESHOLD" acronym="UART5_TX_DMA_THRESHOLD" offset="0x84" width="32" description="">
		<bitfield id="TX_DMA_THRESHOLD" width="6" begin="5" end="0" resetval="0x0" description="Use to manually set the TX DMA threshold level." range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_MDR4" acronym="UART5_MDR4" offset="0x88" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Not Defined" range="7" rwaccess="RO"/> 
		<bitfield id="MODE9" width="1" begin="6" end="6" resetval="0x0" description="9-bit character length. When '1', overrides character length setting in LCR" range="6" rwaccess="RW"/> 
		<bitfield id="FREQ_SEL_H" width="3" begin="5" end="3" resetval="0x0" description="Upper 3 bits of FREQ_SEL register for higher division values, as required for example for FI/Di in ISO7816 mode" range="5 - 3" rwaccess="RW"/> 
		<bitfield id="MODE" width="3" begin="2" end="0" resetval="0x0" description="New modes [when set, overrides MDR1 modes]    0x0   |   DISABLEDdisabled (no override)      0x1   |   RESERVEDreserved      0x2   |   SYNCH_EXTSynchronous mode with external clock      0x3   |   SYNCH_GENSynchronous mode with generated clock      0x4   |   ISO7816_0ISO 7816 mode T=0      0x5   |   ISO7816_1ISO 7816 mode T=1      0x6   |   RESERVED1reserved      0x7   |   RESERVED2reserved  " range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_EFR2" acronym="UART5_EFR2" offset="0x8C" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="BROADCAST" width="1" begin="7" end="7" resetval="0x0" description="Enables broadcast address matching in multi-drop address match mode" range="7" rwaccess="RW"/> 
		<bitfield id="TIMEOUT_BEHAVE" width="1" begin="6" end="6" resetval="0x0" description="Specifies how timeout is measured    0   |   _0timeout after at least one character has been received      1   |   _1periodic timeout even when no character has been received  " range="6" rwaccess="RW"/> 
		<bitfield id="C8" width="1" begin="5" end="5" resetval="0x0" description="Value for ISO 7816 C8 pin for software control" range="5" rwaccess="RW"/> 
		<bitfield id="C4" width="1" begin="4" end="4" resetval="0x0" description="Value for ISO 7816 C4 pin for software control" range="4" rwaccess="RW"/> 
		<bitfield id="C2" width="1" begin="3" end="3" resetval="0x0" description="Value for ISO 7816 reset pin [software controllable]" range="3" rwaccess="RW"/> 
		<bitfield id="MULTIDROP" width="1" begin="2" end="2" resetval="0x0" description="Enables parity Multi-drop mode [overrides LCR[5..3]] when '1'" range="2" rwaccess="RW"/> 
		<bitfield id="RHR_OVERRUN" width="1" begin="1" end="1" resetval="0x0" description="RHR Overrun behaviour when buffer full    0   |   DEFAULTdata in RHR is not overwritten (standard)      1   |   ATMELdata in RHR is overwritten when buffer full (and FIFO disabled)  " range="1" rwaccess="RW"/> 
		<bitfield id="ENDIAN" width="1" begin="0" end="0" resetval="0x0" description="Endianness    0   |   LOW_ENDIANLittle Endian (LSB First)      1   |   BIG_ENDIANBig Endian (MSB First)  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART5_ECR" acronym="UART5_ECR" offset="0x90" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="CLEAR_TX_PE" width="1" begin="5" end="5" resetval="0x0" description="Write 1 to clear parity error from the Transmitter to allow it to continue to try sending data [ISO7816 transmit only]" range="5" rwaccess="WO"/> 
		<bitfield id="TX_EN" width="1" begin="4" end="4" resetval="0x1" description="Enables/Disables the transmitter    0   |   DISABLEDTransmitter is shut down      1   |   ENABLEDTransmitter is working  " range="4" rwaccess="RW"/> 
		<bitfield id="RX_EN" width="1" begin="3" end="3" resetval="0x1" description="Enables/Disables the receiver    0   |   DISABLEDReceiver is shut down      1   |   ENABLEDReceiver is operating  " range="3" rwaccess="RW"/> 
		<bitfield id="TX_RST" width="1" begin="2" end="2" resetval="0x0" description="Writing '1' resets the transmitter" range="2" rwaccess="WO"/> 
		<bitfield id="RX_RST" width="1" begin="1" end="1" resetval="0x0" description="Writing '1' resets the receiver" range="1" rwaccess="WO"/> 
		<bitfield id="A_MULTIDROP" width="1" begin="0" end="0" resetval="0x0" description="In multi-drop mode, when written with the value '1' causes the next byte written into THR to be transmitted with the parity bit set, signaling an address" range="0" rwaccess="WO"/>
	</register>
	<register id="UART5_TIMEGUARD" acronym="UART5_TIMEGUARD" offset="0x94" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TIMEGUARD" width="8" begin="7" end="0" resetval="0x0" description="Specifies the amount of idle baud clocks [transmitter bit period] to  insert between  transmitted bytes, useful when comunicating with slower devices" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_TIMEOUTL" acronym="UART5_TIMEOUTL" offset="0x98" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TIMEOUT_L" width="8" begin="7" end="0" resetval="0x0" description="Custom timeout period in baud clocks, to override the internal value, when different from 0. [Lower byte of the 16 bit value]" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_TIMEOUTH" acronym="UART5_TIMEOUTH" offset="0x9C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TIMEOUT_H" width="8" begin="7" end="0" resetval="0x0" description="Custom timeout period in baud clocks, to override the internal value, when different from 0. [Higher byte of the 16 bit value]" range="7 - 0" rwaccess="RW"/>
	</register>
