IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART5_UART5.xml
	<register id="UART5_SCCR" acronym="UART5_SCCR" offset="0xA0" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DSNACK" width="1" begin="7" end="7" resetval="0x0" description="Applies Max_Iteration to receiver aswell - when maximum number of NACKs  have been returned, the receiver will accept the data regardless of error. The data will be loaded into the receiver FIFO and PE will be set when reading it." range="7" rwaccess="RW"/> 
		<bitfield id="INACK" width="1" begin="6" end="6" resetval="0x0" description="Inhibit NACK when receiving, even if an error is received. The data will be loaded into the receiver FIFO and PE will be set when reading it." range="6" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="3" begin="5" end="3" resetval="0x0" description="Not Defined" range="5 - 3" rwaccess="RO"/> 
		<bitfield id="MAX_ITERATION" width="3" begin="2" end="0" resetval="0x7" description="Number of times to repeat transmitted character, if the receiver did not acknowledge. If not acknowledged after the max value is reached, the USART transmitter will set parity error, stop and not continue until it is cleared." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_ETHR" acronym="UART5_ETHR" offset="0xA4" width="32" description="">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="Not Defined" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="ETHR" width="9" begin="8" end="0" resetval="0x0" description="Extended Transmit Holding Register - allows writing the full 9bit RHR" range="8 - 0" rwaccess="WO"/>
	</register>
	<register id="UART5_ERHR" acronym="UART5_ERHR" offset="0xA4" width="32" description="">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="Not Defined" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="ERHR" width="9" begin="8" end="0" resetval="0x0" description="Extended Receive Holding Register - allows accessing the full 9bit RHR" range="8 - 0" rwaccess="RO"/>
	</register>
	<register id="UART5_MAR" acronym="UART5_MAR" offset="0xA8" width="8" description="">
		<bitfield id="ADDRESS" width="8" begin="7" end="0" resetval="0x0" description="Multidrop match address value" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_MMR" acronym="UART5_MMR" offset="0xAC" width="8" description="">
		<bitfield id="MASK" width="8" begin="7" end="0" resetval="0x0" description="Address match masking value ? writing a 0 to a bit means that the corresponding address bit will be ignored in matching" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART5_MBR" acronym="UART5_MBR" offset="0xB0" width="8" description="">
		<bitfield id="BROADCAST_ADDRESS" width="8" begin="7" end="0" resetval="0x0" description="Broadcast address for address matching" range="7 - 0" rwaccess="RW"/>
	</register>
</module>